# Práctica 11: Qlik

- Martínez Ostoa Néstor Iván
- Visualización de la Información
- LCD, IIMAS, UNAM

## Datos PIB

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('data/PIB/data.csv')
print(df.shape)
df.head()

(4316, 6)

      country  year    gdpcap   lifexp       pop continent
0     Algeria  1960  7.154916  51.1232  11124892    Africa
1   Argentina  1960  8.566341  64.7428  20619075  Americas
2   Australia  1960  9.149282  71.0420  10292328   Oceania
3     Austria  1960  8.913844  68.9320   7065525    Europe
4  Bangladesh  1960  5.540577  44.7330  48200702      Asia

In [5]:
df.year.unique()

array([1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970,
       1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981,
       1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992,
       1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003,
       2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011])

In [6]:
df.continent.unique()

array(['Africa', 'Americas', 'Oceania', 'Europe', 'Asia'], dtype=object)

In [7]:
df[df.continent == "Americas"].country.unique()

array(['Argentina', 'Bolivia', 'Brazil', 'Canada', 'Chile', 'Colombia',
       'Costa Rica', 'Dominican Republic', 'Ecuador', 'El Salvador',
       'Guatemala', 'Honduras', 'Mexico', 'Nicaragua', 'Panama',
       'Paraguay', 'Peru', 'Trinidad and Tobago', 'United States',
       'Uruguay', 'Venezuela'], dtype=object)

In [8]:
non_latin_american = [
    "Canada", "United States"
]
american_df = df[df.continent == "Americas"]
latin_american_df = american_df[~american_df.country.isin(non_latin_american)]
print(latin_american_df.country.unique())

['Argentina' 'Bolivia' 'Brazil' 'Chile' 'Colombia' 'Costa Rica'
 'Dominican Republic' 'Ecuador' 'El Salvador' 'Guatemala' 'Honduras'
 'Mexico' 'Nicaragua' 'Panama' 'Paraguay' 'Peru' 'Trinidad and Tobago'
 'Uruguay' 'Venezuela']

In [9]:
latin_american_df.to_csv('latin_america.csv', index=False)

## Datos NASA

In [14]:
antartica_df = pd.read_csv("data/NASA/0_antartica_mass.csv")
greenland_df = pd.read_csv("data/NASA/0_greenland_mass.csv")
greenland_df.head()

      year     day  greenland_mass_GT  greenland_sigma_deviation
0  2002.29    0.00             134.28                        NaN
1  2002.35   70.88              70.59                        NaN
2  2002.62 -217.33              53.36                        NaN
3  2002.71 -238.82              64.95                        NaN
4  2002.79 -206.42              39.05                        NaN

In [25]:
co2_df = pd.read_csv("data/NASA/1_co2_monthly_mean.txt", sep="    ")
print(co2_df.shape)
co2_df.head()

(758, 8)
<ipython-input-25-92a537dad6bd>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  co2_df = pd.read_csv("data/NASA/1_co2_monthly_mean.txt", sep="    ")

,year,month,decimal_date,co2_avg,a,b,c,d
0,1958,3,1958.2027,315.70,314.43,-1 -9.99 -0.99,None,None
1,1958,4,1958.2877,317.45,315.16,-1 -9.99 -0.99,None,None
2,1958,5,1958.3699,317.51,314.71,-1 -9.99 -0.99,None,None
3,1958,6,1958.4548,317.24,315.14,-1 -9.99 -0.99,None,None
4,1958,7,1958.5370,315.86,315.18,-1 -9.99 -0.99,None,None

In [26]:
co2_df = co2_df.loc[:, ['year', 'month', 'co2_avg']]
co2_df.head()

   year  month   co2_avg
0  1958      3    315.70
1  1958      4    317.45
2  1958      5    317.51
3  1958      6    317.24
4  1958      7    315.86

In [34]:
co2_df.to_csv('data/NASA/co2_mm.csv', index=False)

In [20]:
land_ocean_temp_idx_df = pd.read_csv("data/NASA/1_land_ocean_temperature_index.txt", sep="    ")
print(land_ocean_temp_idx_df.shape)
land_ocean_temp_idx_df.head()

(141, 3)
<ipython-input-20-5e82776d83db>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  land_ocean_temp_idx_df = pd.read_csv("data/NASA/1_land_ocean_temperature_index.txt", sep="    ")

   Year   No_Smoothing   Lowess
0  1880          -0.17    -0.09
1  1881          -0.08    -0.13
2  1882          -0.10    -0.16
3  1883          -0.17    -0.20
4  1884          -0.28    -0.23

In [33]:
land_ocean_temp_idx_df.to_csv('data/NASA/loti.csv', index=False)

In [30]:
gmsl_df = pd.read_csv('data/NASA/1_global_mean_sea_level.txt', sep=' ')
print(gmsl_df.shape)
gmsl_df.head()

(1035, 12)

,altimeter,merged_file_cycle,year_fraction_of_year,number_of_observations,number_of_weighted_observations,GMSL,std_GMSL,smoother_GMSL,GMSL_variation,std_of_GMSL,a,b
0,0,11,1993.011526,452600,327401.31,-38.59,89.86,-38.76,-38.59,89.86,-38.75,-38.57
1,0,12,1993.038692,447591,324498.41,-41.97,90.86,-39.78,-41.97,90.86,-39.77,-39.11
2,0,13,1993.065858,459462,333018.19,-41.93,87.27,-39.62,-41.91,87.27,-39.61,-38.58
3,0,14,1993.093025,410064,297483.19,-42.67,90.75,-39.67,-42.65,90.74,-39.64,-38.34
4,0,15,1993.120191,446813,321635.81,-37.86,90.26,-38.75,-37.83,90.25,-38.72,-37.21

In [31]:
gmsl_df = gmsl_df.loc[:, ['year_fraction_of_year', 'GMSL']]
gmsl_df.head()

   year_fraction_of_year    GMSL
0            1993.011526  -38.59
1            1993.038692  -41.97
2            1993.065858  -41.93
3            1993.093025  -42.67
4            1993.120191  -37.86

In [32]:
gmsl_df.to_csv('data/NASA/gmsl.csv', index=False)